{"pageProps":{"post":{"attributes":{},"html":"<ul>\n<li>Source  <a href=\"https://algo.monster/problems/stats\">https://algo.monster/problems/stats</a></li>\n</ul>\n<p><img src=\"https://docs.google.com/spreadsheets/d/e/2PACX-1vSjxdU-rSVhGYJp3c3MkCUmGnOeNK2vwS-EGusfTNha06aE16rokcxvQPOn3YJwZ64DS77chith9vxK/pubchart?oid=469888469&format=image\" alt=\"Top ROI problems\"></p>\n<h2 id=\"trends\">Trends</h2>\n<h2 id=\"highest-roi-dfs-bfs-two-pointers\">Highest ROI: DFS, BFS, Two pointers</h2>\n<p>Depth-first search(DFS), breadth-first search(BFS) and two pointers, make up a good portion of all interview problems. DFS in particular can be used to solve a wide range of problems from tree to graph to combinatorial problems and is very useful in tech interviews. </p>\n<h2 id=\"linked-list-stack-and-queue-high-roi\">Linked list, stack, and queue high ROI</h2>\n<p>These problems get asked a lot, but there aren&#39;t many variations. For example, the linked list category has several classic problems such as reversing a linked list, finding the middle node of a linked list, and linked list cycle detection that get asked repeatedly.</p>\n<h2 id=\"priority-queueheap-medium-roi\">Priority Queue/heap medium ROI</h2>\n<p>Priority queue and heap show up surprisingly more often than most would think. The classic problems include the median of a data stream, k closest points.</p>\n<h2 id=\"greedy-dynamic-programming\">Greedy, Dynamic programming</h2>\n<p>Dynamic programming (DP) is hard to summarize and does not frequently appear (unless you are interviewing Google, whose engineers like to ask DP problems). There are a few classic problems you may want to know such as house robber and robot paths. Otherwise, you should probably focus on higher ROI areas if you are short on time. Also, if you can&#39;t figure out a dynamic programming solution, you can always do DFS + memoization which does the same thing.</p>\n<p>Each greedy problem is different, and it&#39;s hard to summarize a pattern, and the correctness of your solution often requires rigorous mathematical proof that is hard to learn in a short time. Therefore, we consider the greedy problem to be low ROI.</p>\n<h2 id=\"trie-union-find-medium-low-roi\">Trie, Union Find medium-low ROI</h2>\n<p>These don&#39;t appear often but do show up. Consider them of secondary priority.</p>\n","slug":"top-patterns","title":"Top Patterns","section":"The First Section","icon":"info-circle","filePath":"/home/runner/work/spaced-grokking-course/spaced-grokking-course/lessons/01-the-first-section/C-top-patterns.md","nextSlug":"/spaced-grokking-course/lessons/the-first-section/Opionated-approach","prevSlug":"/spaced-grokking-course/lessons/the-first-section/all-patterns"}},"__N_SSG":true}